app/serializers/meditation_serializer.rb

SELECT COUNT(*) FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 1]]
---
  def listens
    object.plays.size