app/serializers/student_serializer.rb

SELECT SUM("plays"."length") FROM "plays" WHERE "plays"."student_id" = $1  [["student_id", 1]]
---
  def total_time
    object.plays.sum(:length)

SELECT "plays".* FROM "plays" WHERE "plays"."student_id" = $1 ORDER BY "plays"."created_at" DESC LIMIT $2  [["student_id", 1], ["LIMIT", 5]]
---
   def recent_plays
     plays = object.plays.order(created_at: :desc).limit(5)
     recent_plays = plays.collect {|p| PlaySerializer.new(p)}

SELECT SUM("donations"."amount") FROM "donations" WHERE "donations"."student_id" = $1  [["student_id", 1]]
---
   def total_donations
     object.donations.sum(:amount)

SELECT "donations".* FROM "donations" WHERE "donations"."student_id" = $1  [["student_id", 1]]
---
   def most_donated_teacher
     if object.donations.length == 0

SELECT "meditations".* FROM "meditations"
SELECT "plays".* FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 1]]
---
  def most_pop_med
    med = Meditation.all.max_by {|m| m.plays.length}

SELECT "plays".* FROM "plays" WHERE "plays"."student_id" = $1  [["student_id", 1]]
---
   def plays_id
     plays = object.plays
     if plays.length == 0