app/serializers/teacher_serializer.rb

  def total_listens
    object.meditations.map {|m| m.plays.length}.reduce(:+)
---
SELECT "plays".* FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 1]]

  def total_favorites
    object.meditations.map {|m| m.favorites.length}.reduce(:+)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."meditation_id" = $1  [["meditation_id", 1]]

  def total_income
    object.donations.sum(:amount)
---
SELECT SUM("donations"."amount") FROM "donations" WHERE "donations"."teacher_id" = $1  [["teacher_id", 1]]

  def most_donated_student
    if object.donations.length == 0
---
SELECT "donations".* FROM "donations" WHERE "donations"."teacher_id" = $1  [["teacher_id", 1]]

  def last_med
    if object.meditations.length > 0
---
SELECT "meditations".* FROM "meditations" WHERE "meditations"."teacher_id" = $1  [["teacher_id", 1]]