app/serializers/teacher_index_serializer.rb

SELECT "meditations".* FROM "meditations" WHERE "meditations"."teacher_id" = $1  [["teacher_id", 1]]
---
  def med_number
    object.meditations.length

SELECT "plays".* FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 1]]
---
  def total_listens
    object.meditations.map {|m| m.plays.length}.reduce(:+)