app/controllers/log_in_controller.rb

  def create
    if params[:type] == 'student'
       user = Student.find_by(email: params[:email])
       session[:student_id] = user.id
    else
      user = Teacher.find_by(email: params[:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "guestS"], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "guest"], ["LIMIT", 1]]

  def me
    student = Student.find_by(id: session[:student_id])
    teacher = Teacher.find_by(id: session[:teacher_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" IS NULL LIMIT $1  [["LIMIT", 1]]