app/controllers/meditations_controller.rb

SELECT "meditations".* FROM "meditations"
---
  def index
    render json: Meditation.all

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
     meditation = Meditation.find(params[:id])

INSERT INTO "meditations" ("med_type", "title", "description", "est_length", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    meditation = Meditation.create!(med_params)

UPDATE "meditations" SET "updated_at" = $1 WHERE "meditations"."id" = $2  [["updated_at", "2021-09-05 12:22:20.552221"], ["id", 1]]
---
  def update
    med = Meditation.find(params[:id])
    med.update!(update_params)

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "meditations".* FROM "meditations" WHERE "meditations"."teacher_id" = $1  [["teacher_id", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "meditations".* FROM "meditations" WHERE "meditations"."teacher_id" = $1 ORDER BY "meditations"."created_at" DESC  [["teacher_id", 1]]
DELETE FROM "meditations" WHERE "meditations"."id" = $1  [["id", 1]]
---
  def destroy
    med = Meditation.find(params[:id])
    currentL = med.teacher.meditations.length
    last_med = med.teacher.meditations.order(created_at: :desc).slice(1)
    med.destroy