app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    teacher = Teacher.find(params[:id])