app/controllers/users_controller.rb

INSERT INTO "students" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "teachers" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    if (params[:type] == "student")
      user = Student.create!(user_params)
    else
      user = Teacher.create!(user_params)